backend_api/app/controllers/downvotes_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "downvotes" ("question_id", "layman_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question_id", 1], ["layman_id", 23], ["created_at", "2020-04-16 01:50:20.544075"], ["updated_at", "2020-04-16 01:50:20.544075"]]
SELECT "elabs".* FROM "elabs" WHERE "elabs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
INSERT INTO "downvotes" ("question_id", "layman_id", "elab_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 1], ["layman_id", 1], ["elab_id", 17], ["created_at", "2020-04-15 03:50:30.787457"], ["updated_at", "2020-04-15 03:50:30.787457"]]
---
     def create
           if params[:question_id]
               # check if upvote is placed on question
               question = Question.find(params[:question_id])
               downvote = question.downvotes.build
               if downvote.save
                    render json: DownvoteSerializer.new(downvote).serialized_json
               else
                    render json: { erros: downvote.errors }
               end
          elsif params[:elab_id]
               # check if upvote is placed on elab
               elab = Elab.find(params[:elab_id])
               downvote = elab.downvotes.build
               downvote.question_id = elab.question_id
               if downvote.save