backend_api/app/controllers/elabs_controller.rb

     def update
          # hard coded for now
          if params[:question_id]
               question = Question.find(params[:question_id])
               elab = question.elabs.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "elabs".* FROM "elabs" WHERE "elabs"."question_id" = $1 AND "elabs"."id" = $2 LIMIT $3  [["question_id", 2], ["id", 22], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

     def destroy
          if params[:question_id]
               question = Question.find(params[:question_id])
               elab = question.elabs.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "elabs".* FROM "elabs" WHERE "elabs"."question_id" = $1 AND "elabs"."id" = $2 LIMIT $3  [["question_id", 1], ["id", 21], ["LIMIT", 1]]