backend_api/app/controllers/elabs_controller.rb

     def index
          if params[:question_id]
               question = Question.find(params[:question_id])
               elabs = question.elabs
          else
               elabs = Elab.all
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "elabs".* FROM "elabs"

     def show
          if params[:question_id]
               question = Question.find(params[:question_id])
               elab = question.elabs.find(params[:id])
          else
               elab = Elab.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "elabs".* FROM "elabs" WHERE "elabs"."question_id" = $1 AND "elabs"."id" = $2 LIMIT $3  [["question_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "elabs".* FROM "elabs" WHERE "elabs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

     def create
          if params[:question_id]
               question = Question.find(params[:question_id])
               elab = question.elabs.build(elab_params)
               elab.layman = Layman.find(2) # hard coded for now
               if elab.save
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "elabs".* FROM "elabs" WHERE "elabs"."question_id" = $1 AND "elabs"."id" = $2 LIMIT $3  [["question_id", 2], ["id", 22], ["LIMIT", 1]]
INSERT INTO "elabs" ("elaboration", "question_id", "layman_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["elaboration", "this is basically saying..."], ["question_id", 2], ["layman_id", 2], ["created_at", "2020-04-14 20:15:37.447696"], ["updated_at", "2020-04-14 20:15:37.447696"]]

     def update
          marissa = Layman.find(2)
          elab = marissa.elabs.find(params[:id])
          if elab.update(elab_params)
---
SELECT "elabs".* FROM "elabs" INNER JOIN "questions" ON "elabs"."question_id" = "questions"."id" WHERE "questions"."layman_id" = $1 AND "elabs"."id" = $2 LIMIT $3  [["layman_id", 19], ["id", 21], ["LIMIT", 1]]
UPDATE "elabs" SET "elaboration" = $1, "updated_at" = $2 WHERE "elabs"."id" = $3  [["elaboration", "Marissa joseph is a monk"], ["updated_at", "2020-04-14 20:53:09.835630"], ["id", 15]]

     def destroy
          marissa = Layman.find(2)
          elab = marissa.elabs.find(params[:id])
          if elab.destroy
---
SELECT "elabs".* FROM "elabs" WHERE "elabs"."layman_id" = $1 AND "elabs"."id" = $2 LIMIT $3  [["layman_id", 2], ["id", 15], ["LIMIT", 1]]
DELETE FROM "elabs" WHERE "elabs"."id" = $1  [["id", 15]]