backend_api/app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
     def index
          questions = Question.all

SELECT "questions".* FROM "questions" WHERE "questions"."layman_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["layman_id", 1], ["id", 9], ["LIMIT", 1]]
---
     def show
          if params[:layman_id ]
               layman = Layman.find(params[:layman_id])
               question = layman.questions.find(params[:id])

INSERT INTO "questions" ("topic", "pasted_info", "layman_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["topic", "Avengers"], ["pasted_info", "Hulk is the best"], ["layman_id", 1], ["created_at", "2020-04-16 01:19:11.631758"], ["updated_at", "2020-04-16 01:19:11.631758"]]
---
     def create
          question = current_layman.questions.build(question_params)
          if question.save

SELECT "questions".* FROM "questions" WHERE "questions"."layman_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["layman_id", 1], ["id", 16], ["LIMIT", 1]]
UPDATE "questions" SET "pasted_info" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["pasted_info", "Hulk is the best avenger to be specific"], ["updated_at", "2020-04-16 01:20:58.741038"], ["id", 16]]
---
     def update
          if params[:layman_id]
               layman = Layman.find(params[:layman_id])
               question = layman.questions.find(params[:id])
               # if question.layman_id == current_layman.id
                    if question.update(question_params)

SELECT "questions".* FROM "questions" WHERE "questions"."layman_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["layman_id", 1], ["id", 16], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 16]]
---
     def destroy
          # should test against current user
          layman = Layman.find(params[:layman_id])
          question = layman.questions.find(params[:id])
          if question.destroy