backend_api/app/controllers/replies_controller.rb

     def create
          if params[:elab_id]
               elab = Elab.find(params[:elab_id])
               reply = elab.replies.build(reply_params)
               reply.layman_id = current_layman.id
               if reply.save
---
SELECT "elabs".* FROM "elabs" WHERE "elabs"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
INSERT INTO "replies" ("elab_id", "created_at", "updated_at", "content", "layman_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["elab_id", 6], ["created_at", "2020-04-15 14:20:05.900559"], ["updated_at", "2020-04-15 14:20:05.900559"], ["content", "Oh ok, I understand"], ["layman_id", 1]]

     def update
          if params[:elab_id]
               elab = Elab.find(params[:elab_id])
               reply = elab.replies.find(params[:id])
               # if reply.layman_id == current_layman.id
                    if reply.update(reply_params)
---
SELECT "elabs".* FROM "elabs" WHERE "elabs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."elab_id" = $1 AND "replies"."id" = $2 LIMIT $3  [["elab_id", 3], ["id", 36], ["LIMIT", 1]]
UPDATE "replies" SET "content" = $1, "updated_at" = $2 WHERE "replies"."id" = $3  [["content", "I ABSOLUTELY AGREE"], ["updated_at", "2020-04-16 01:57:22.247679"], ["id", 36]]

     def destroy
          if params[:elab_id]
               elab = Elab.find(params[:elab_id])
               reply = elab.replies.find(params[:id])
               # if reply.layman == current_layman
                    reply.destroy
---
SELECT "elabs".* FROM "elabs" WHERE "elabs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."elab_id" = $1 AND "replies"."id" = $2 LIMIT $3  [["elab_id", 3], ["id", 36], ["LIMIT", 1]]
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 36]]