backend_api/app/controllers/upvotes_controller.rb

     def create
          if params[:question_id]
               # check if upvote is placed on question
               question = Question.find(params[:question_id])
               upvote = question.upvotes.build
               upvote.layman_id = current_layman.id
               if upvote.save
                    render json: UpvoteSerializer.new(upvote).serializable_hash
               else
                    render json: { erros: upvote.errors }
               end
          elsif params[:elab_id]
               # check if upvote is placed on elab
               elab = Elab.find(params[:elab_id])
               upvote = elab.upvotes.build
               upvote.layman_id = current_layman.id
               upvote.question_id = elab.question_id
               if upvote.save
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "upvotes" ("question_id", "layman_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question_id", 1], ["layman_id", 1], ["created_at", "2020-04-15 02:48:59.052509"], ["updated_at", "2020-04-15 02:48:59.052509"]]
SELECT "elabs".* FROM "elabs" WHERE "elabs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
INSERT INTO "upvotes" ("question_id", "layman_id", "elab_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_id", 1], ["layman_id", 1], ["elab_id", 17], ["created_at", "2020-04-15 02:51:15.823727"], ["updated_at", "2020-04-15 02:51:15.823727"]]