backend/app/controllers/questions_controller.rb

     def set_laymans_question
          @question = @layman.questions.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."layman_id" = $1  [["layman_id", 5]]