backend/app/controllers/questions_controller.rb

     def index
          questions = Question.all
---
SELECT "questions".* FROM "questions"

     def show
          if params[:layman_id]
               layman = Layman.find(params[:layman_id])
               question = layman.questions.find(params[:id])
               render json: QuestionSerializer.new(question).serializable_hash
          else
               question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."layman_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["layman_id", 5], ["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

     def create
          layman = Layman.find(params[:layman_id])
          question = layman.questions.build(question_params)
          if question.save
---
INSERT INTO "questions" ("topic", "url", "pasted_info", "layman_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

     def update
          layman = Layman.find(params[:layman_id])
          question = layman.questions.find(params[:id])
          if question.update(question_params)
---
SELECT "questions".* FROM "questions" WHERE "questions"."layman_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["layman_id", 5], ["id", 11], ["LIMIT", 1]]
UPDATE "questions" SET "pasted_info" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["pasted_info", "simple HTML page"], ["updated_at", "2020-04-14 05:20:26.259526"], ["id", 11]]

     def destroy
          layman = Layman.find(params[:layman_id])
          question = layman.questions.find(params[:id])
          if question.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."layman_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["layman_id", 5], ["id", 2], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]